""" Напишите программу, которая выводит на экран результат вычисления
2+2. """

a = 2
b = 2
c = a + b
print ( c )