""" Напишите программу, которая запрашивает у пользователя его возраст
и выводит на экран сообщение "Ваш возраст [возраст] лет". """

age = input("Введите ваш возраст : ")
print("Ваш возраст " + age + "!")