""" Напишите программу, которая запрашивает у пользователя слово и
выводит на экран его первую букву. """

slovo = input( "Введите слово: " )
print(slovo[0])