""" Напишите программу, которая выводит на экран фразу "Привет, мир!". """

print ("Hello World!")