""" Напишите программу, которая запрашивает у пользователя целое число
и выводит на экран его квадрат. """

num = int(input( "Введите число: " ))
num2 = num**2
print( "Квадрат выбранного числа равен ", num2 )