""" Напишите программу, которая выводит на экран таблицу умножения на
число 5. """

x=0
while x<11:
    x+=1
    z = 5 * x
    print("5 x", x, "=", z)
