""" Напишите программу, которая запрашивает у пользователя его имя и
выводит на экран сообщение "Привет, [имя]!". """

name = input("Введите ваше имя: ")
print("Привет, " + name + "!")