""" Напишите программу, которая выводит на экран числа от 1 до 10. """

for i in range(1, 11):
    print(i)