""" Напишите программу, которая запрашивает у пользователя два числа и
выводит на экран их произведение. """

num1 = int(input("Введите первое число: "))
num2 = int(input("Введите второе число: "))

proizvedenie = num1 * num2

print("Произведение чисел:", proizvedenie)